w6d4/art_project/app/controllers/artworks_controller.rb

    def index
        owned = Artwork.where(artist_id: params[:user_id]) #id: 19 from a User.id
        shared = Artwork.joins(:shared_users).where(artwork_shares: {viewer_id: params[:user_id]})
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", "21"]]

    def show
        a = Artwork.find_by(id: params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        a = Artwork.new(artwork_params)
        if a.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Apathetic Lizard"], ["image_url", "www.lizarddddddd.com"], ["artist_id", 2]]

    def update
        a = Artwork.find_by(id: params[:id])
        if a.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3 WHERE "artworks"."id" = $4  [["title", "Sad Doge"], ["image_url", "www.midlife.com"], ["artist_id", 2], ["id", 1]]

    def destroy
        a = Artwork.find_by(id: params[:id])
        n = a.title
        if a.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]