w6d4/art_project/app/controllers/users_controller.rb

INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "billybob"]]
---
    def create
        n = User.new(user_params)
        if n.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        n = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "bobby tables"], ["id", 4]]
---
    def update
        n = User.find(params[:id])
        if n.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        n = User.find(params[:id])
        name = n.username
        n.destroy